StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/efuse/rtw_efuse.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/
#define _RTW_EFUSE_C_

#include <drv_types.h>
#include <hal_data.h>

#include "../hal/efuse/efuse_mask.h"

/*------------------------Define local variable------------------------------*/
u8	fakeEfuseBank = {0};
u32	fakeEfuseUsedBytes = {0};
u8	fakeEfuseContent[EFUSE_MAX_HW_SIZE] = {0};
u8	fakeEfuseInitMap[EFUSE_MAX_MAP_LEN] = {0};
u8	fakeEfuseModifiedMap[EFUSE_MAX_MAP_LEN] = {0};

u32	BTEfuseUsedBytes = {0};
u8	BTEfuseContent[EFUSE_MAX_BT_BANK][EFUSE_MAX_HW_SIZE];
u8	BTEfuseInitMap[EFUSE_BT_MAX_MAP_LEN] = {0};
u8	BTEfuseModifiedMap[EFUSE_BT_MAX_MAP_LEN] = {0};

u32	fakeBTEfuseUsedBytes = {0};
u8	fakeBTEfuseContent[EFUSE_MAX_BT_BANK][EFUSE_MAX_HW_SIZE];
u8	fakeBTEfuseInitMap[EFUSE_BT_MAX_MAP_LEN] = {0};
u8	fakeBTEfuseModifiedMap[EFUSE_BT_MAX_MAP_LEN] = {0};

u8	maskfileBuffer[64];
u8	btmaskfileBuffer[64];

/*------------------------Define local variable------------------------------*/
BOOLEAN rtw_file_efuse_IsMasked(PADAPTER pAdapter, u16 Offset, u8 *maskbuf)
{
	int r = Offset / 16;
	int c = (Offset % 16) / 2;
	int result = 0;

	if (pAdapter->registrypriv.boffefusemask) {
		return FALSE;
	}

	if (c < 4) { /* Upper double word */
		result = (maskbuf[r] & (0x10 << c));
	} else {
		result = (maskbuf[r] & (0x01 << (c - 4)));
	}

	return (result > 0) ? 0 : 1;
}

BOOLEAN efuse_IsBT_Masked(PADAPTER pAdapter, u16 Offset)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(pAdapter);

	if (pAdapter->registrypriv.boffefusemask) {
		return FALSE;
	}

#ifdef CONFIG_BT_EFUSE_MASK
#ifdef CONFIG_RTL8822C
#ifdef CONFIG_USB_HCI
	if (IS_HARDWARE_TYPE_8822C(pAdapter)) {
		return (IS_BT_MASKED(8822C, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#ifdef CONFIG_PCI_HCI
	if (IS_HARDWARE_TYPE_8822C(pAdapter)) {
		return (IS_BT_MASKED(8822C, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif
#ifdef CONFIG_SDIO_HCI
	if (IS_HARDWARE_TYPE_8822C(pAdapter)) {
		return (IS_BT_MASKED(8822C, _MSDIO, Offset)) ? TRUE : FALSE;
	}
#endif
#endif /*#ifdef CONFIG_RTL8822C*/
#ifdef CONFIG_RTL8730A
#ifdef CONFIG_AXI_HCI
	/*to do*/
#endif
#endif /*#ifdef CONFIG_RTL8730A*/
#endif /* CONFIG_BT_EFUSE_MASK */
	return FALSE;
}

void rtw_bt_efuse_mask_array(PADAPTER pAdapter, u8 *pArray)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(pAdapter);

#ifdef CONFIG_BT_EFUSE_MASK
#ifdef CONFIG_RTL8822C
#ifdef CONFIG_USB_HCI
	if (IS_HARDWARE_TYPE_8822CU(pAdapter)) {
		GET_BT_MASK_ARRAY(8822C, _MUSB, pArray);
	}
#endif
#ifdef CONFIG_PCI_HCI
	if (IS_HARDWARE_TYPE_8822CE(pAdapter)) {
		GET_BT_MASK_ARRAY(8822C, _MPCIE, pArray);
	}
#endif
#ifdef CONFIG_SDIO_HCI
	if (IS_HARDWARE_TYPE_8822CS(pAdapter)) {
		GET_BT_MASK_ARRAY(8822C, _MSDIO, pArray);
	}
#endif
#endif /*#ifdef CONFIG_RTL8822C*/
#ifdef CONFIG_RTL8730A
#ifdef CONFIG_AXI_HCI
	/*to do*/
#endif
#endif /*#ifdef CONFIG_RTL8730A*/
#endif /* CONFIG_BT_EFUSE_MASK */

}

u16 rtw_get_bt_efuse_mask_arraylen(PADAPTER pAdapter)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(pAdapter);

#ifdef CONFIG_BT_EFUSE_MASK
#ifdef CONFIG_RTL8822C
#ifdef CONFIG_USB_HCI
	if (IS_HARDWARE_TYPE_8822CU(pAdapter)) {
		return GET_BT_MASK_ARRAY_LEN(8822C, _MUSB);
	}
#endif
#ifdef CONFIG_PCI_HCI
	if (IS_HARDWARE_TYPE_8822CE(pAdapter)) {
		return GET_BT_MASK_ARRAY_LEN(8822C, _MPCIE);
	}
#endif
#ifdef CONFIG_SDIO_HCI
	if (IS_HARDWARE_TYPE_8822CS(pAdapter)) {
		return GET_BT_MASK_ARRAY_LEN(8822C, _MSDIO);
	}
#endif
#endif /*#ifdef CONFIG_RTL8822C*/
#ifdef CONFIG_RTL8730A
#ifdef CONFIG_AXI_HCI
	/*to do*/
#endif
#endif /*CONFIG_RTL8730A*/
#endif /* CONFIG_BT_EFUSE_MASK */

	return 0;
}

BOOLEAN efuse_IsMasked(PADAPTER pAdapter, u16 Offset)
{

	if (pAdapter->registrypriv.boffefusemask) {
		return FALSE;
	}

#ifdef CONFIG_USB_HCI
#if defined(CONFIG_RTL8188E)
	if (IS_HARDWARE_TYPE_8188E(pAdapter)) {
		return (IS_MASKED(8188E, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8812A)
	if (IS_HARDWARE_TYPE_8812(pAdapter)) {
		return (IS_MASKED(8812A, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8821A)
#if 0
	if (IS_HARDWARE_TYPE_8811AU(pAdapter)) {
		return (IS_MASKED(8811A, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
	if (IS_HARDWARE_TYPE_8821(pAdapter)) {
		return (IS_MASKED(8821A, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8192E)
	if (IS_HARDWARE_TYPE_8192E(pAdapter)) {
		return (IS_MASKED(8192E, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8723B)
	if (IS_HARDWARE_TYPE_8723B(pAdapter)) {
		return (IS_MASKED(8723B, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8703B)
	if (IS_HARDWARE_TYPE_8703B(pAdapter)) {
		return (IS_MASKED(8703B, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8814A)
	if (IS_HARDWARE_TYPE_8814A(pAdapter)) {
		return (IS_MASKED(8814A, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8188F)
	if (IS_HARDWARE_TYPE_8188F(pAdapter)) {
		return (IS_MASKED(8188F, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8188GTV)
	if (IS_HARDWARE_TYPE_8188GTV(pAdapter)) {
		return (IS_MASKED(8188GTV, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8822B)
	if (IS_HARDWARE_TYPE_8822B(pAdapter)) {
		return (IS_MASKED(8822B, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8723D)
	if (IS_HARDWARE_TYPE_8723D(pAdapter)) {
		return (IS_MASKED(8723D, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8710B)
	if (IS_HARDWARE_TYPE_8710B(pAdapter)) {
		return (IS_MASKED(8710B, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8821C)
	if (IS_HARDWARE_TYPE_8821CU(pAdapter)) {
		return (IS_MASKED(8821C, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif

#if defined(CONFIG_RTL8192F)
	if (IS_HARDWARE_TYPE_8192FU(pAdapter)) {
		return (IS_MASKED(8192F, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8822C)
	if (IS_HARDWARE_TYPE_8822C(pAdapter)) {
		return (IS_MASKED(8822C, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8814B)
	if (IS_HARDWARE_TYPE_8814B(pAdapter)) {
		return (IS_MASKED(8814B, _MUSB, Offset)) ? TRUE : FALSE;
	}
#endif
#endif /*CONFIG_USB_HCI*/

