StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/efuse/rtw_efuse.c
#ifdef CONFIG_PCI_HCI
#if defined(CONFIG_RTL8188E)
	if (IS_HARDWARE_TYPE_8188E(pAdapter)) {
		return (IS_MASKED(8188E, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8192E)
	if (IS_HARDWARE_TYPE_8192E(pAdapter)) {
		return (IS_MASKED(8192E, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8812A)
	if (IS_HARDWARE_TYPE_8812(pAdapter)) {
		return (IS_MASKED(8812A, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8821A)
	if (IS_HARDWARE_TYPE_8821(pAdapter)) {
		return (IS_MASKED(8821A, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8723B)
	if (IS_HARDWARE_TYPE_8723B(pAdapter)) {
		return (IS_MASKED(8723B, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8814A)
	if (IS_HARDWARE_TYPE_8814A(pAdapter)) {
		return (IS_MASKED(8814A, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8822B)
	if (IS_HARDWARE_TYPE_8822B(pAdapter)) {
		return (IS_MASKED(8822B, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8821C)
	if (IS_HARDWARE_TYPE_8821CE(pAdapter)) {
		return (IS_MASKED(8821C, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif

#if defined(CONFIG_RTL8192F)
	if (IS_HARDWARE_TYPE_8192FE(pAdapter)) {
		return (IS_MASKED(8192F, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8822C)
	if (IS_HARDWARE_TYPE_8822C(pAdapter)) {
		return (IS_MASKED(8822C, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8814B)
	if (IS_HARDWARE_TYPE_8814B(pAdapter)) {
		return (IS_MASKED(8814B, _MPCIE, Offset)) ? TRUE : FALSE;
	}
#endif
#endif /*CONFIG_PCI_HCI*/

#ifdef CONFIG_SDIO_HCI
#ifdef CONFIG_RTL8188E_SDIO
	if (IS_HARDWARE_TYPE_8188E(pAdapter)) {
		return (IS_MASKED(8188E, _MSDIO, Offset)) ? TRUE : FALSE;
	}
#endif
#ifdef CONFIG_RTL8723B
	if (IS_HARDWARE_TYPE_8723BS(pAdapter)) {
		return (IS_MASKED(8723B, _MSDIO, Offset)) ? TRUE : FALSE;
	}
#endif
#ifdef CONFIG_RTL8188F
	if (IS_HARDWARE_TYPE_8188F(pAdapter)) {
		return (IS_MASKED(8188F, _MSDIO, Offset)) ? TRUE : FALSE;
	}
#endif
#ifdef CONFIG_RTL8188GTV
	if (IS_HARDWARE_TYPE_8188GTV(pAdapter)) {
		return (IS_MASKED(8188GTV, _MSDIO, Offset)) ? TRUE : FALSE;
	}
#endif
#ifdef CONFIG_RTL8192E
	if (IS_HARDWARE_TYPE_8192ES(pAdapter)) {
		return (IS_MASKED(8192E, _MSDIO, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8821A)
	if (IS_HARDWARE_TYPE_8821S(pAdapter)) {
		return (IS_MASKED(8821A, _MSDIO, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8821C)
	if (IS_HARDWARE_TYPE_8821CS(pAdapter)) {
		return (IS_MASKED(8821C, _MSDIO, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8822B)
	if (IS_HARDWARE_TYPE_8822B(pAdapter)) {
		return (IS_MASKED(8822B, _MSDIO, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8192F)
	if (IS_HARDWARE_TYPE_8192FS(pAdapter)) {
		return (IS_MASKED(8192F, _MSDIO, Offset)) ? TRUE : FALSE;
	}
#endif
#if defined(CONFIG_RTL8822C)
	if (IS_HARDWARE_TYPE_8822C(pAdapter)) {
		return (IS_MASKED(8822C, _MSDIO, Offset)) ? TRUE : FALSE;
	}
#endif
#endif /*CONFIG_SDIO_HCI*/

#ifdef CONFIG_AXI_HCI
#if defined(CONFIG_RTL8730A)
	/*to do*/
#endif
#endif /*CONFIG_SDIO_HCI*/

	return FALSE;
}

void rtw_efuse_mask_array(PADAPTER pAdapter, u8 *pArray)
{

#ifdef CONFIG_USB_HCI
#if defined(CONFIG_RTL8188E)
	if (IS_HARDWARE_TYPE_8188E(pAdapter)) {
		GET_MASK_ARRAY(8188E, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8812A)
	if (IS_HARDWARE_TYPE_8812(pAdapter)) {
		GET_MASK_ARRAY(8812A, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8821A)
	if (IS_HARDWARE_TYPE_8821(pAdapter)) {
		GET_MASK_ARRAY(8821A, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8192E)
	if (IS_HARDWARE_TYPE_8192E(pAdapter)) {
		GET_MASK_ARRAY(8192E, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8723B)
	if (IS_HARDWARE_TYPE_8723B(pAdapter)) {
		GET_MASK_ARRAY(8723B, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8703B)
	if (IS_HARDWARE_TYPE_8703B(pAdapter)) {
		GET_MASK_ARRAY(8703B, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8188F)
	if (IS_HARDWARE_TYPE_8188F(pAdapter)) {
		GET_MASK_ARRAY(8188F, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8188GTV)
	if (IS_HARDWARE_TYPE_8188GTV(pAdapter)) {
		GET_MASK_ARRAY(8188GTV, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8814A)
	if (IS_HARDWARE_TYPE_8814A(pAdapter)) {
		GET_MASK_ARRAY(8814A, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8822B)
	if (IS_HARDWARE_TYPE_8822B(pAdapter)) {
		GET_MASK_ARRAY(8822B, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8821C)
	if (IS_HARDWARE_TYPE_8821CU(pAdapter)) {
		GET_MASK_ARRAY(8821C, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8192F)
	if (IS_HARDWARE_TYPE_8192FU(pAdapter)) {
		GET_MASK_ARRAY(8192F, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8822C)
	if (IS_HARDWARE_TYPE_8822C(pAdapter)) {
		GET_MASK_ARRAY(8822C, _MUSB, pArray);
	}
#endif
#if defined(CONFIG_RTL8814B)
	if (IS_HARDWARE_TYPE_8814B(pAdapter)) {
		GET_MASK_ARRAY(8814B, _MUSB, pArray);
	}
#endif
#endif /*CONFIG_USB_HCI*/

#ifdef CONFIG_PCI_HCI
#if defined(CONFIG_RTL8188E)
	if (IS_HARDWARE_TYPE_8188E(pAdapter)) {
		GET_MASK_ARRAY(8188E, _MPCIE, pArray);
	}
#endif
#if defined(CONFIG_RTL8192E)
	if (IS_HARDWARE_TYPE_8192E(pAdapter)) {
		GET_MASK_ARRAY(8192E, _MPCIE, pArray);
	}
#endif
#if defined(CONFIG_RTL8812A)
	if (IS_HARDWARE_TYPE_8812(pAdapter)) {
		GET_MASK_ARRAY(8812A, _MPCIE, pArray);
	}
#endif
#if defined(CONFIG_RTL8821A)
	if (IS_HARDWARE_TYPE_8821(pAdapter)) {
		GET_MASK_ARRAY(8821A, _MPCIE, pArray);
	}
#endif
#if defined(CONFIG_RTL8723B)
	if (IS_HARDWARE_TYPE_8723B(pAdapter)) {
		GET_MASK_ARRAY(8723B, _MPCIE, pArray);
	}
#endif
#if defined(CONFIG_RTL8814A)
	if (IS_HARDWARE_TYPE_8814A(pAdapter)) {
		GET_MASK_ARRAY(8814A, _MPCIE, pArray);
	}
#endif
#if defined(CONFIG_RTL8822B)
	if (IS_HARDWARE_TYPE_8822B(pAdapter)) {
		GET_MASK_ARRAY(8822B, _MPCIE, pArray);
	}
#endif
#if defined(CONFIG_RTL8821C)
	if (IS_HARDWARE_TYPE_8821CE(pAdapter)) {
		GET_MASK_ARRAY(8821C, _MPCIE, pArray);
	}
#endif
#if defined(CONFIG_RTL8192F)
	if (IS_HARDWARE_TYPE_8192FE(pAdapter)) {
		GET_MASK_ARRAY(8192F, _MPCIE, pArray);
	}
#endif
#if defined(CONFIG_RTL8822C)
	if (IS_HARDWARE_TYPE_8822C(pAdapter)) {
		GET_MASK_ARRAY(8822C, _MPCIE, pArray);
	}
#endif
#if defined(CONFIG_RTL8814B)
	if (IS_HARDWARE_TYPE_8814B(pAdapter)) {
		GET_MASK_ARRAY(8814B, _MPCIE, pArray);
	}
#endif
#endif /*CONFIG_PCI_HCI*/

#ifdef CONFIG_SDIO_HCI
#if defined(CONFIG_RTL8188E)
	if (IS_HARDWARE_TYPE_8188E(pAdapter)) {
		GET_MASK_ARRAY(8188E, _MSDIO, pArray);
	}
#endif
#if defined(CONFIG_RTL8723B)
	if (IS_HARDWARE_TYPE_8723BS(pAdapter)) {
		GET_MASK_ARRAY(8723B, _MSDIO, pArray);
	}
#endif
#if defined(CONFIG_RTL8188F)
	if (IS_HARDWARE_TYPE_8188F(pAdapter)) {
		GET_MASK_ARRAY(8188F, _MSDIO, pArray);
	}
#endif
#if defined(CONFIG_RTL8188GTV)
	if (IS_HARDWARE_TYPE_8188GTV(pAdapter)) {
		GET_MASK_ARRAY(8188GTV, _MSDIO, pArray);
	}
#endif
#if defined(CONFIG_RTL8192E)
	if (IS_HARDWARE_TYPE_8192ES(pAdapter)) {
		GET_MASK_ARRAY(8192E, _MSDIO, pArray);
	}
#endif
#if defined(CONFIG_RTL8821A)
	if (IS_HARDWARE_TYPE_8821S(pAdapter)) {
		GET_MASK_ARRAY(8821A, _MSDIO, pArray);
	}
#endif
#if defined(CONFIG_RTL8821C)
	if (IS_HARDWARE_TYPE_8821CS(pAdapter)) {
		GET_MASK_ARRAY(8821C, _MSDIO, pArray);
	}
#endif
#if defined(CONFIG_RTL8822B)
	if (IS_HARDWARE_TYPE_8822B(pAdapter)) {
		GET_MASK_ARRAY(8822B, _MSDIO, pArray);
	}
#endif
#if defined(CONFIG_RTL8192F)
	if (IS_HARDWARE_TYPE_8192FS(pAdapter)) {
		GET_MASK_ARRAY(8192F, _MSDIO, pArray);
	}
#endif
#if defined(CONFIG_RTL8822C)
	if (IS_HARDWARE_TYPE_8822C(pAdapter)) {
		GET_MASK_ARRAY(8822C, _MSDIO, pArray);
	}
#endif
#endif /*CONFIG_SDIO_HCI*/

#ifdef CONFIG_AXI_HCI
#if defined(CONFIG_RTL8730A)
	/*to do*/
#endif
#endif /*CONFIG_AXI_HCI*/
}

u16 rtw_get_efuse_mask_arraylen(PADAPTER pAdapter)
{

#ifdef CONFIG_USB_HCI
#if defined(CONFIG_RTL8188E)
	if (IS_HARDWARE_TYPE_8188E(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8188E, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8812A)
	if (IS_HARDWARE_TYPE_8812(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8812A, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8821A)
	if (IS_HARDWARE_TYPE_8821(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8821A, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8192E)
	if (IS_HARDWARE_TYPE_8192E(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8192E, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8723B)
	if (IS_HARDWARE_TYPE_8723B(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8723B, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8703B)
	if (IS_HARDWARE_TYPE_8703B(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8703B, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8188F)
	if (IS_HARDWARE_TYPE_8188F(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8188F, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8188GTV)
	if (IS_HARDWARE_TYPE_8188GTV(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8188GTV, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8814A)
	if (IS_HARDWARE_TYPE_8814A(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8814A, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8822B)
	if (IS_HARDWARE_TYPE_8822B(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8822B, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8821C)
	if (IS_HARDWARE_TYPE_8821CU(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8821C, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8192F)
	if (IS_HARDWARE_TYPE_8192FU(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8192F, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8822C)
	if (IS_HARDWARE_TYPE_8822C(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8822C, _MUSB);
	}
#endif
#if defined(CONFIG_RTL8814B)
	if (IS_HARDWARE_TYPE_8814B(pAdapter)) {
		return GET_MASK_ARRAY_LEN(8814B, _MUSB);
	}
#endif
#endif /*CONFIG_USB_HCI*/

